[
    {
        "name": "EquippingWeapons",
        "description": "<b>Equipping and Unequipping Weapons.</b> You can either equip or unequip one weapon when you make an attack. You do so either before or after the attack. If you equip a weapon before an attack, you don't need to use it for that attack. Equipping a weapon includes drawing it from a sheath or picking it up. Unequipping a weapon includes sheathing, stowing, or dropping it.\n\n<b>Time-Limited Object Interactions</b>When time is short, such as in combat, interactions with objects are limited: one free interaction per turn. That interaction must occur during a creature's movement or action. Any additional interactions require the Utilize action."
    },
    {
        "name": "Mounted Combat",
        "description": "<b>Mounted Combat.</b> A willing creature that is at least one size larger than a rider and that has an appropriate anatomy can serve as a mount, using the following rules.\n\n<b>Mounting and Dismounting.</b> During your move, you can mount a creature that is within 5 feet of you or dismount. Doing so costs an amount of movement equal to half your Speed (round down).\n\n<b>Controlling a Mount.</b> You can control a mount only if it has been trained to accept a rider. Domesticated horses, mules, and similar creatures have such training.\n\nThe Initiative of a controlled mount changes to match yours when you mount it. It moves on your turn as you direct it, and it has only three action options during that turn: Dash, Disengage, and Dodge. A controlled mount can move and act even on the turn that you mount it.\n\nIn contrast, an independent mount (one that lets you ride but ignores your control) retains its place in the Initiative order and moves and acts as it likes.\n\n<b>Falling Off.</b> If an effect is about to move your mount against its will while you're on it, you must succeed on a DC 10 Dexterity saving throw or fall off, landing with the Prone condition (see the rules glossary) in an unoccupied space within 5 feet of the mount.\n\nWhile mounted, you must make the same save if you're knocked Prone or the mount is."
    },
    {
        "name": "Ranged",
        "description": "You can make ranged attacks only against targets within a specified range. If a ranged attack, such as one made with a spell, has a single range, you can't attack a target beyond this range. Some ranged attacks, such as those made with a Longbow, have two ranges. The smaller number is the normal range, and the larger number is the long range. Your attack roll has Disadvantage when your target is beyond normal range, and you can't attack a target beyond long range.\n\n<b>Ranged Attacks in Close Combat.</b> Aiming a ranged attack is more difficult when a foe is next to you. When you make a ranged attack roll with a weapon, a spell, or some other means, you have Disadvantage on the roll if you are within 5 feet of an enemy who can see you and doesn't have the <b>Incapacitated</b> condition.",
        "weaponAttackAddendum": {
            "calculation": [
                {
                    "type": "static",
                    "value": "<b>Ranged.</b> You have Disadvantage on the attack roll if "
                },
                {
                    "type": "if-then",
                    "if": [
                        {
                            "type": "parameter",
                            "propertyPath": "weapon.range.long"
                        }
                    ],
                    "then": [
                        {
                            "type": "static",
                            "value": "you are over "
                        },
                        {
                            "type": "parameter",
                            "propertyPath": "weapon.range.normal"
                        },
                        {
                            "type": "static",
                            "value": " feet away from the target or "
                        }
                    ],
                    "else": [
                        {
                            "type": "static",
                            "value": ""
                        }
                    ]
                },
                {
                    "type": "static",
                    "value": "you are within 5 feet of an enemy who can see you and doesn't have the <b>Incapacitated</b> condition. <b>Paralyzed</b>, <b>Petrified</b>, <b>Stunned</b>, and <b>Unconscious</b> each also give the Incapacitated condition."
                }
            ]
        }
    }
]